src/Tasks/ЗаявкаНаВыполнение/ЗаявкаНаВыполнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗаявкаНаВыполнение</name>
  <addressing>InformationRegister.АдресацияЗаявокНаВыполнение</addressing>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.АдресатыПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеКраткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусЗадачНаВыполнение</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Письма</name>
    <attributes>
      <name>Письмо</name>
      <type>
        <types>DocumentRef.ВходящееПисьмо</types>
        <types>DocumentRef.ИсходящееПисьмо</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнутренниеКоментарии</name>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>Оповещать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>АдресацияКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>АдресацияИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>АдресацияИнициатор</name>
    <type>
      <types>CatalogRef.АдресатыПочтовыхСообщений</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

src/InformationRegisters/ДвоичныеДанныеФайлов/ДвоичныеДанныеФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДвоичныеДанныеФайлов</name>
  <resources>
    <name>ДвоичныеДанныеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсторияЗаявокНаВыполнение/ИсторияЗаявокНаВыполнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЗаявокНаВыполнение</name>
  <dimensions>
    <name>ЗаявкаНаВыполнение</name>
    <type>
      <types>TaskRef.ЗаявкаНаВыполнение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусЗадачНаВыполнение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрежнийСтатус</name>
    <type>
      <types>CatalogRef.СтатусЗадачНаВыполнение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрежнийИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ИсходящееПисьмо/ИсходящееПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИсходящееПисьмо</name>
  <basedOn>Catalog.ВнутренниеДокументы</basedOn>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <basedOn>Catalog.ПроектныеЗадачи</basedOn>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <basedOn>Catalog.Мероприятия</basedOn>
  <basedOn>Catalog.Файлы</basedOn>
  <basedOn>Catalog.УведомленияПрограммы</basedOn>
  <basedOn>Document.Отсутствие</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВажностьПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаршрутизации</name>
    <type>
      <types>EnumRef.ВидыМаршрутизацииПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСпособаАдресации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительКонтакт</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ЛичныеАдресаты</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправкаОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоОснование</name>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодготовленоКОтправке</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиПисьмаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.УведомленияПрограммы</types>
      <types>CatalogRef.Проекты</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>CatalogRef.КонтрольныеТочки</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВидаМаршрутизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаHTMLХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтвета</name>
    <type>
      <types>EnumRef.ТипыОтвета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкрытыхКопий</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКонтакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/СтатусЗадачНаВыполнение/СтатусЗадачНаВыполнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусЗадачНаВыполнение</name>
  <predefined>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>ПолученОтвет</name>
      <description>Получен ответ</description>
    </items>
    <items>
      <name>Принята</name>
      <description>Принята</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/Tasks/ЗаявкаНаВыполнение/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)   
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//АдресацияИсполнитель = Исполнитель;
	
	Если (Ссылка.Статус <> Статус) 
		И НЕ ЭтоНовый() И Статус = Справочники.СтатусЗадачНаВыполнение.ПолученОтвет Тогда // Оповестить об ответе
		
		ИсходящееПисьмо = Документы.ИсходящееПисьмо.СоздатьДокумент();
		
		НовСтрПолучатель = ИсходящееПисьмо.ПолучателиПисьма.Добавить();
		НовСтрПолучатель.Адресат = млкПодпискиНаСобытия.ПолучитьАдресат(АдресацияИсполнитель);
		
		ИсходящееПисьмо.Тема = Тема + " [#" + Номер + "]";
		
		ХранилищеТекста = Новый ХранилищеЗначения("Задача  [#" + Номер + "]
		|По задаче  " + Номер + " получен ответ. 
		|Статус изменен на: " + Статус.Наименование + Символы.ПС + "
		|
		|Содержание: " +  Содержание);
		
		ИсходящееПисьмо.ТекстХранилище = ХранилищеТекста;
		ИсходящееПисьмо.УчетнаяЗапись = Константы.УчетнаяЗаписьПоддержки.Получить();
		ТекДата = ТекущаяДата();
		ИсходящееПисьмо.Дата = ТекДата;			
		ИсходящееПисьмо.ТекстХранилище = ХранилищеТекста;
		ИсходящееПисьмо.ПодготовленоКОтправке  = ТекДата;
		ИсходящееПисьмо.УчетнаяЗапись = Константы.УчетнаяЗаписьПоддержки.Получить();
		ИсходящееПисьмо.Записать();  
				
	ИначеЕсли (Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель ИЛИ Ссылка.Статус <> Статус) 
		И НЕ ЭтоНовый() И НЕ Статус = Справочники.СтатусЗадачНаВыполнение.Выполнена Тогда // Оповестить об изменении
		
		Если Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель Тогда
			НП = Получатели.Добавить();
			НП.Адресат = млкПодпискиНаСобытия.ПолучитьАдресат(АдресацияИсполнитель);
			НП.Оповещать = Истина;
		КонецЕсли;	
		
		ИсходящееПисьмо = Документы.ИсходящееПисьмо.СоздатьДокумент();
		
		НовСтрПолучатель = ИсходящееПисьмо.ПолучателиПисьма.Добавить();
		НовСтрПолучатель.Адресат = Инициатор;
		
		Для Каждого Стр ИЗ Получатели Цикл
			НовСтрПолучатель = ИсходящееПисьмо.ПолучателиПисьма.Добавить();
			НовСтрПолучатель.Адресат = Стр.Адресат;
		КонецЦикла;	
		
		НовСтрПолучатель = ИсходящееПисьмо.ПолучателиПисьма.Добавить();
		НовСтрПолучатель.Адресат = млкПодпискиНаСобытия.ПолучитьАдресат(АдресацияИсполнитель);
		
		ИсходящееПисьмо.Тема = Тема + " [#" + Номер + "]";
		Если Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель И Ссылка.Статус <> Статус Тогда
			ХранилищеТекста = Новый ХранилищеЗначения("Задача  [#" + Номер + "]
			|Назначена на исполнение сотруднику: " + АдресацияИсполнитель.Наименование + Символы.ПС + "
			|Статус изменен на: " + Статус.Наименование + Символы.ПС + "
			|
			|Содержание: " +  Содержание);  

		ИначеЕсли Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель Тогда
			ХранилищеТекста = Новый ХранилищеЗначения("Задача  [#" + Номер + "]" + Символы.ПС + "
			|Назначена на исполнение сотруднику: " + АдресацияИсполнитель.Наименование  + Символы.ПС + "
			|
			|Содержание: " +  Содержание);   
		ИначеЕсли Ссылка.Статус <> Статус Тогда
			ХранилищеТекста = Новый ХранилищеЗначения("Задача  [#" + Номер + "]" + Символы.ПС + "
			|Статус изменен на: " + Статус.Наименование + Символы.ПС + "
			|
			|Содержание: " +  Содержание);    
		КонецЕсли;	
		
		ТекДата = ТекущаяДата();
		ИсходящееПисьмо.Дата = ТекДата;			
		ИсходящееПисьмо.ТекстХранилище = ХранилищеТекста;
		ИсходящееПисьмо.ПодготовленоКОтправке  = ТекДата;
		ИсходящееПисьмо.УчетнаяЗапись = Константы.УчетнаяЗаписьПоддержки.Получить();
		ИсходящееПисьмо.Записать();
		Если Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Файлы.Ссылка
			|ИЗ
			|	Справочник.Файлы КАК Файлы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.ЗаявкаНаВыполнение.Письма КАК ЗаявкаНаВыполнениеПисьма
			|		ПО Файлы.ВладелецФайла = ЗаявкаНаВыполнениеПисьма.Письмо
			|ГДЕ
			|	ЗаявкаНаВыполнениеПисьма.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Файл = Выборка.Ссылка.ПолучитьОбъект();
				Версия = Файл.ТекущаяВерсия.ПолучитьОбъект();
				
				Запрос.Текст = "ВЫБРАТЬ
				|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла
				|ИЗ
				|	РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
				|ГДЕ
				|	ДвоичныеДанныеФайлов.Файл = &ВерсияФайла
				|	И ДвоичныеДанныеФайлов.Файл.Размер > 5000";
				Запрос.УстановитьПараметр("ВерсияФайла",Версия.Ссылка);
				ВыборкаДанных = Запрос.Выполнить().Выбрать();
				Если ВыборкаДанных.Следующий() Тогда
					НовыйФайл = Файл.Скопировать();
					НовыйФайл.ВладелецФайла = ИсходящееПисьмо.Ссылка;
					НовыйФайл.Записать();
					
					НоваяВерсия = Версия.Скопировать();
					НоваяВерсия.Владелец = НовыйФайл.Ссылка;
					АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Версия.ФайлХранилище.Получить(), Новый УникальныйИдентификатор());
					НоваяВерсия.ФайлХранилище = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
					НоваяВерсия.Записать();
					
					НовыйФайл.ТекущаяВерсия = НоваяВерсия.Ссылка;
					НовыйФайл.ТекущаяВерсияКод = НоваяВерсия.Код;
					НовыйФайл.Записать();
					
					Набор = РегистрыСведений.ДвоичныеДанныеФайлов.СоздатьНаборЗаписей();
					Набор.Отбор.Файл.Установить(НоваяВерсия.Ссылка);
					Запись = Набор.Добавить();
					Запись.Файл = НоваяВерсия.Ссылка;
					Запись.ДвоичныеДанныеФайла = ВыборкаДанных.ДвоичныеДанныеФайла;
					Набор.Записать();
				КонецЕсли;
			КонецЦикла;	
			
		КонецЕсли;	
	КонецЕсли;	  
	
	//Создадим данные для отражения изменения.
	Изменения = Новый Структура("ЕстьИзменения,Статус,Исполнитель,ПрежнийСтатус,ПрежнийИсполнитель");   
	Изменения.ЕстьИзменения = Ложь;
	
	Если Ссылка.Статус <> Статус 
		И Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель Тогда // Оповестить об ответе
		
            Изменения.ЕстьИзменения = Истина;
	        Изменения.Статус = Статус; 
			Изменения.Исполнитель = АдресацияИсполнитель;
			Изменения.ПрежнийСтатус = Ссылка.Статус; 
			Изменения.ПрежнийИсполнитель = Ссылка.АдресацияИсполнитель;
		
	ИначеЕсли (Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель) Тогда // Оповестить об изменении
		
		    Изменения.ЕстьИзменения = Истина;
			Изменения.Исполнитель = АдресацияИсполнитель;
			Изменения.ПрежнийИсполнитель = Ссылка.АдресацияИсполнитель;  
			
	ИначеЕсли Ссылка.Статус <> Статус Тогда	
			
			Изменения.ЕстьИзменения = Истина;
	        Изменения.Статус = Статус; 
			Изменения.ПрежнийСтатус = Ссылка.Статус; 
		
	КонецЕсли;	
	
	ДополнительныеСвойства.Вставить("Изменения",Изменения);  	
КонецПроцедуры

Процедура ПриВыполнении(Отказ) 
	
	Статус = Справочники.СтатусЗадачНаВыполнение.Выполнена;
	Если НЕ ЗначениеЗаполнено(ДатаВыполнения) Тогда
		ДатаВыполнения = ТекущаяДата();     
	КонецЕсли;    
	
	Если не ЗначениеЗаполнено(Решение) Тогда
		Отказ = Истина;
		Сообщить("Для выполнения необходимо заполнить решение");
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)     
	Если ДополнительныеСвойства.Изменения.ЕстьИзменения Тогда  
		МенеджерЗаписи = РегистрыСведений.ИсторияЗаявокНаВыполнение.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ДатаВремя = ТекущаяДата();  
		МенеджерЗаписи.ЗаявкаНаВыполнение = Ссылка;
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ДополнительныеСвойства.Изменения);		
		МенеджерЗаписи.Записать();
	КонецЕсли;	
КонецПроцедуры
